In [1]:
import pandas as pd

In [2]:
data = {
    'roti': [3, 2, 0, 1],
    'cola': [0, 3, 7, 2],
    'tisu': [5, 1, 1, 8]
}

In [4]:
transaksi = pd.DataFrame(data)
transaksi

   roti  cola  tisu
0     3     0     5
1     2     3     1
2     0     7     1
3     1     2     8

In [5]:
transaksi = pd.DataFrame(data, index = ['Ani', 'Budi', 'Citra', 'David'])
transaksi

       roti  cola  tisu
Ani       3     0     5
Budi      2     3     1
Citra     0     7     1
David     1     2     8

In [6]:
customer = ['Ani', 'Budi', 'Citra', 'David']
transaksi = pd.DataFrame(data, index = customer)
transaksi

       roti  cola  tisu
Ani       3     0     5
Budi      2     3     1
Citra     0     7     1
David     1     2     8

In [7]:
transaksi.loc['Citra']

roti    0
cola    7
tisu    1
Name: Citra, dtype: int64

In [9]:
transaksi.iloc[1] # index 1 adalah Budi

roti    2
cola    3
tisu    1
Name: Budi, dtype: int64

In [12]:
df = pd.read_csv(r'C:\Users\HP\python\dataset\transaksi.csv')
df

  Unnamed: 0  roti  cola  tisu
0        Ani     3     0     5
1       Budi     2     3     1
2      Citra     0     7     1
3      David     1     2     8

In [13]:
# Rename dulu

new_columns = df.columns.values
new_columns[0] = 'nama'
df.columns = new_columns

In [14]:
df = df.set_index('nama')
df

       roti  cola  tisu
nama
Ani       3     0     5
Budi      2     3     1
Citra     0     7     1
David     1     2     8

In [16]:
df = pd.read_csv(r'C:\Users\HP\python\dataset\transaksi.csv', index_col = 0)
df

       roti  cola  tisu
Ani       3     0     5
Budi      2     3     1
Citra     0     7     1
David     1     2     8

In [18]:
import pandas as pd
from pandas import ExcelWriter
from pandas import ExcelFile

df_excel = pd.read_excel(r'C:\Users\HP\python\dataset\transaksi.xlsx', index_col = 0)
df_excel

#print("")

       roti  cola  susu
Ani       3     0     5
Budi      2     3     1
Citra     0     7     1
David     1     2     8

In [19]:
df.to_csv('new_transaksi.csv')

with ExcelWriter('new_transaksi.xlsx') as writer:
    df_excel.to_excel(writer)

In [22]:
movie_df = pd.read_csv(r'C:\Users\HP\python\dataset\IMDB-Movie-Data.csv', index_col = 'Title')
movie_df.head()

,Rank,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
Title,,,,,,,,,,,
Guardians of the Galaxy,1,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
Prometheus,2,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
Split,3,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0
Sing,4,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0
Suicide Squad,5,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40.0

In [23]:
movie_df.tail(3)

,Rank,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
Title,,,,,,,,,,,
Step Up 2: The Streets,998,"Drama,Music,Romance",Romantic sparks occur between two dance studen...,Jon M. Chu,"Robert Hoffman, Briana Evigan, Cassie Ventura,...",2008,98,6.2,70699,58.01,50.0
Search Party,999,"Adventure,Comedy",A pair of friends embark on a mission to reuni...,Scot Armstrong,"Adam Pally, T.J. Miller, Thomas Middleditch,Sh...",2014,93,5.6,4881,NaN,22.0
Nine Lives,1000,"Comedy,Family,Fantasy",A stuffy businessman finds himself trapped ins...,Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,12435,19.64,11.0

In [24]:
movie_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1000 entries, Guardians of the Galaxy to Nine Lives
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Rank                1000 non-null   int64
 1   Genre               1000 non-null   object
 2   Description         1000 non-null   object
 3   Director            1000 non-null   object
 4   Actors              1000 non-null   object
 5   Year                1000 non-null   int64
 6   Runtime (Minutes)   1000 non-null   int64
 7   Rating              1000 non-null   float64
 8   Votes               1000 non-null   int64
 9   Revenue (Millions)  872 non-null    float64
 10  Metascore           936 non-null    float64
dtypes: float64(3), int64(4), object(4)
memory usage: 93.8+ KB

In [25]:
movie_df.shape

(1000, 11)

In [26]:
temp_df = movie_df.append(movie_df) # bikin duplikasi
temp_df.shape

(2000, 11)

In [59]:
temp_df = temp_df.drop_duplicates()
# akan mengeluarkan return value data diremove duplicate nya, tapi gak disimpan dimana-mana

temp_df.shape

(1000, 11)

In [60]:
temp_df.drop_duplicates(inplace = True)
# inplace = True berarti data hasil perubahan nya langsung disimpan di file yang sama

temp_df.shape

(1000, 11)

In [61]:
temp_df2 = movie_df.append(movie_df)
temp_df2.drop_duplicates(inplace = True, keep = False)
# keep = False --> berarti kalo ada yang sama dihapus semuanya
# keep = first --> berarti kalo ada data yang sama maka data pertama yang diambil
# keep = last --> berarti kalo ada data yang sama maka data terakhir yang diambil

temp_df2.shape

(0, 11)

In [32]:
movie_df.columns

Index(['Rank', 'Genre', 'Description', 'Director', 'Actors', 'Year',
       'Runtime (Minutes)', 'Rating', 'Votes', 'Revenue (Millions)',
       'Metascore'],
      dtype='object')

In [34]:
movie_df.rename(columns={
    'Runtime (Minutes)': 'Runtime',
    'Revenue (Millions)': 'Revenue_millions'
}, inplace = True)

movie_df.columns

Index(['Rank', 'Genre', 'Description', 'Director', 'Actors', 'Year', 'Runtime',
       'Rating', 'Votes', 'Revenue_millions', 'Metascore'],
      dtype='object')

In [37]:
# cara bar2

# movie_df.columns = ['Rank', 'Genre', 'Description', 'Director', 'Actors', 'Year', 'Runtime',
#        'Rating', 'Votes', 'Revenue_millions', 'Metascore']
# movie_df.columns

# cara bagusnya
movie_df.columns = [col.lower() for col in movie_df]
movie_df.columns

Index(['rank', 'genre', 'description', 'director', 'actors', 'year', 'runtime',
       'rating', 'votes', 'revenue_millions', 'metascore'],
      dtype='object')

MENGATASI MISSING VALUES

1. Hilangkan baris atau kolom dengan null
2. Ganti nilai dengan non-null (imputation)

In [38]:
movie_df.isnull()

,rank,genre,description,director,actors,year,runtime,rating,votes,revenue_millions,metascore
Title,,,,,,,,,,,
Guardians of the Galaxy,False,False,False,False,False,False,False,False,False,False,False
Prometheus,False,False,False,False,False,False,False,False,False,False,False
Split,False,False,False,False,False,False,False,False,False,False,False
Sing,False,False,False,False,False,False,False,False,False,False,False
Suicide Squad,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...
Secret in Their Eyes,False,False,False,False,False,False,False,False,False,True,False
Hostel: Part II,False,False,False,False,False,False,False,False,False,False,False
Step Up 2: The Streets,False,False,False,False,False,False,False,False,False,False,False
Search Party,False,False,False,False,False,False,False,False,False,True,False
Nine Lives,False,False,False,False,False,False,False,False,False,False,False

In [42]:
# Menghitung jumlah yang null (revenue ada 128 null dan matascore ada 64)

movie_df.isnull().sum()

rank                  0
genre                 0
description           0
director              0
actors                0
year                  0
runtime               0
rating                0
votes                 0
revenue_millions    128
metascore            64
dtype: int64

In [44]:
# Dropna untuk membuang baris data yang null

test_drop = movie_df.dropna()
test_drop.shape

(838, 11)

In [45]:
# Menghapus kolom yang mengandung null

test_drop = movie_df.dropna(axis = 1)
test_drop.shape

(1000, 9)

In [49]:
# ekstrak dulu revenue, agar lebih jelas

revenue = movie_df['revenue_millions']
revenue.head()

Title
Guardians of the Galaxy    333.13
Prometheus                 126.46
Split                      138.12
Sing                       270.32
Suicide Squad              325.02
Name: revenue_millions, dtype: float64

In [51]:
# ganti dengan mean/median
# ini untuk mengetahui mean nya

revenue_mean = revenue.mean()
revenue_mean

82.95637614678897

In [52]:
# isi null dengan mean

revenue.fillna(revenue_mean, inplace = True)

In [53]:
movie_df.isnull().sum()

rank                 0
genre                0
description          0
director             0
actors               0
year                 0
runtime              0
rating               0
votes                0
revenue_millions     0
metascore           64
dtype: int64

In [54]:
# Melihat statistik deskriptif

movie_df.describe()

,rank,year,runtime,rating,votes,revenue_millions,metascore
count,1000.000000,1000.000000,1000.000000,1000.000000,1.000000e+03,1000.000000,936.000000
mean,500.500000,2012.783000,113.172000,6.723200,1.698083e+05,82.956376,58.985043
std,288.819436,3.205962,18.810908,0.945429,1.887626e+05,96.412043,17.194757
min,1.000000,2006.000000,66.000000,1.900000,6.100000e+01,0.000000,11.000000
25%,250.750000,2010.000000,100.000000,6.200000,3.630900e+04,17.442500,47.000000
50%,500.500000,2014.000000,111.000000,6.800000,1.107990e+05,60.375000,59.500000
75%,750.250000,2016.000000,123.000000,7.400000,2.399098e+05,99.177500,72.000000
max,1000.000000,2016.000000,191.000000,9.000000,1.791916e+06,936.630000,100.000000

In [62]:
# pengen tau keterangan ttg describe atau shape atau lainnyatinggal tambah tanda '?'

movie_df.describe?

In [56]:
movie_df['genre'].describe()

count                        1000
unique                        207
top       Action,Adventure,Sci-Fi
freq                           50
Name: genre, dtype: object

In [57]:
# untuk melihat berapa banyak genre film tertentu yg 10 teratas

movie_df['genre'].value_counts().head(10)

Action,Adventure,Sci-Fi       50
Drama                         48
Comedy,Drama,Romance          35
Comedy                        32
Drama,Romance                 31
Animation,Adventure,Comedy    27
Action,Adventure,Fantasy      27
Comedy,Drama                  27
Comedy,Romance                26
Crime,Drama,Thriller          24
Name: genre, dtype: int64

In [58]:
# Mengetahui korelasi antar kolom

movie_df.corr()

,rank,year,runtime,rating,votes,revenue_millions,metascore
rank,1.000000,-0.261605,-0.221739,-0.219555,-0.283876,-0.252996,-0.191869
year,-0.261605,1.000000,-0.164900,-0.211219,-0.411904,-0.117562,-0.079305
runtime,-0.221739,-0.164900,1.000000,0.392214,0.407062,0.247834,0.211978
rating,-0.219555,-0.211219,0.392214,1.000000,0.511537,0.189527,0.631897
votes,-0.283876,-0.411904,0.407062,0.511537,1.000000,0.607941,0.325684
revenue_millions,-0.252996,-0.117562,0.247834,0.189527,0.607941,1.000000,0.133328
metascore,-0.191869,-0.079305,0.211978,0.631897,0.325684,0.133328,1.000000